Revit 2024 API
EnergyAnalysisOpening Class
 Analytical opening.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class EnergyAnalysisOpening : Element
Visual Basic
Public Class EnergyAnalysisOpening _
	Inherits Element
Visual C++
public ref class EnergyAnalysisOpening : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening
See Also
EnergyAnalysisOpening Members
Autodesk.Revit.DB.Analysis Namespace